recipes/spicy-buddha-bowl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Spicy Buddha Bowl</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Spicy Buddha Bowl</h1>
<p>
<a href="http://www.crazyvegankitchen.com/spicy-buddha-bowl/">Original link</a>
</p>

<div id="outline-container-orgc52e91e" class="outline-2">
<h2 id="orgc52e91e">Ingredients</h2>
<div class="outline-text-2" id="text-orgc52e91e">
<ul class="org-ul">
<li>1 cup Cooked Brown Rice</li>
<li>1 Sweet Potato, cut into large chunks</li>
<li>1 teaspoon Olive Oil</li>
<li>Salt/Pepper</li>
<li>1 can Organic Chickpeas, drained</li>
<li>1 1/2 tablespoons Sriracha</li>
<li>2 teaspoons Maple Syrup</li>
<li>1/2 teaspoon Paprika</li>
<li>1/2 teaspoon Garlic Powder</li>
<li>Salt/Pepper</li>
<li>1 cup chopped Red Cabbage</li>
<li>1 cup Baby Spinach</li>
<li>1 Avocado, sliced</li>
<li>Turmeric Tahini Dressing:</li>
<li>4 Tablespoons Tahini</li>
<li>4 Tablespoons Warm Water</li>
<li>1 teaspoon Maple Syrup</li>
<li>1/4 teaspoon Cayenne Pepper</li>
<li>1/2 teaspoon Turmeric</li>
<li>1/2 teaspoon Sriracha</li>
<li>Salt to taste</li>
</ul>
</div>
</div>

<div id="outline-container-org7abbae6" class="outline-2">
<h2 id="org7abbae6">Method</h2>
<div class="outline-text-2" id="text-org7abbae6">
<ol class="org-ol">
<li>Preheat oven to 180&deg;C. Coat sweet potato in 1 tsp oil and season with salt and pepper. Place on baking tray and pop into the oven to roast for 35 minutes, turning once halfway through the cooking time.</li>
<li>Whilst sweet potato is cooking, prepare chickpeas.</li>
<li>In a bowl, combine chickpeas, sriracha, maple syrup, paprika, garlic powder, salt and pepper. Mix to combine. Heat a saucepan and transfer chickpea mixture into saucepan to cook for 5-10 minutes. Make sure to keep the chickpeas moving so they don't burn. Cook until chickpeas are slightly sticky and no longer watery. Keep aside.</li>
<li>In a clean saucepan, wilt spinach slightly and season. Transfer to a bowl and repeat the wilting and seasoning process with the cabbage.</li>
<li>Once sweet potato is cooked through, prepare your Buddha Bowl by placing your rice in the bottom of a bowl and then topping with the sweet potato, chickpeas, spinach, red cabbage and avocado.</li>
<li>To make dressing, whisk all ingredients together. Liberally splash on Buddha Bowl and enjoy!!!</li>
</ol>
</div>
</div>
</div>
</body>
</html>
